**FREE

EXEC SQL DEFINE HEADERS
EXEC SQL DEFINE DS

Dcl-S lProdID Int(5);

EXEC SQL CONNECT POWER8

EXEC SQL SELECT PRODID FROM PRODUCTSP
EXEC SQL FETCH INTO lProdID

EXEC SQL CLOSE 
EXEC SQL DISCONNECT

*InLR = *On;
Return;